name: "_internal_prott5_tokenizer"
backend: "python"
max_batch_size: 8

input [
  {
    name: "sequences"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]

output [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [ -1 ]
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [ -1 ]
  }
]

# Shared CPU conda-pack env staged by triton-init at this path.
parameters: {
  key: "EXECUTION_ENV_PATH"
  value: { string_value: "/models/_envs/cpu_py312.tar.gz" }
}
